In [1]:
import pandas as pd
import numpy as np

#### Create Series

In [2]:
labels = ['a','b','c','d']
my_data = [10,20,30,40]
arr = np.array(my_data)
d = {'e':50,'f':60,'g':70,'h':80}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
pd.Series(arr, labels)

a    10
b    20
c    30
d    40
dtype: int32

In [6]:
pd.Series(d)

e    50
f    60
g    70
h    80
dtype: int64

#### Create DataFrame

In [7]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -1.127516  0.071717  0.234162  0.833778
B  0.067727 -0.427208 -1.924143 -1.447222
C  0.092603 -0.918464 -1.802349  0.362110
D  0.026986 -0.875147 -2.031859 -1.162824
E -0.949930  0.294958 -1.140438 -0.863807

#### Create new column in dataframe

In [8]:
df['New'] = df['W']+df['Y']
df

          W         X         Y         Z       New
A -1.127516  0.071717  0.234162  0.833778 -0.893354
B  0.067727 -0.427208 -1.924143 -1.447222 -1.856416
C  0.092603 -0.918464 -1.802349  0.362110 -1.709746
D  0.026986 -0.875147 -2.031859 -1.162824 -2.004873
E -0.949930  0.294958 -1.140438 -0.863807 -2.090368

#### drop column temporarily

In [9]:
df.drop('New', axis=1)

          W         X         Y         Z
A -1.127516  0.071717  0.234162  0.833778
B  0.067727 -0.427208 -1.924143 -1.447222
C  0.092603 -0.918464 -1.802349  0.362110
D  0.026986 -0.875147 -2.031859 -1.162824
E -0.949930  0.294958 -1.140438 -0.863807

In [10]:
df

          W         X         Y         Z       New
A -1.127516  0.071717  0.234162  0.833778 -0.893354
B  0.067727 -0.427208 -1.924143 -1.447222 -1.856416
C  0.092603 -0.918464 -1.802349  0.362110 -1.709746
D  0.026986 -0.875147 -2.031859 -1.162824 -2.004873
E -0.949930  0.294958 -1.140438 -0.863807 -2.090368

#### drop column permanently

In [11]:
df.drop('New', axis=1, inplace=True)

In [12]:
df

          W         X         Y         Z
A -1.127516  0.071717  0.234162  0.833778
B  0.067727 -0.427208 -1.924143 -1.447222
C  0.092603 -0.918464 -1.802349  0.362110
D  0.026986 -0.875147 -2.031859 -1.162824
E -0.949930  0.294958 -1.140438 -0.863807

#### drop row

In [13]:
df.drop('E', axis=0)

          W         X         Y         Z
A -1.127516  0.071717  0.234162  0.833778
B  0.067727 -0.427208 -1.924143 -1.447222
C  0.092603 -0.918464 -1.802349  0.362110
D  0.026986 -0.875147 -2.031859 -1.162824

#### Access row in column based

In [14]:
df.loc['B']

W    0.067727
X   -0.427208
Y   -1.924143
Z   -1.447222
Name: B, dtype: float64

In [15]:
df.iloc[1]

W    0.067727
X   -0.427208
Y   -1.924143
Z   -1.447222
Name: B, dtype: float64

#### writing different conditions

In [16]:
df[df['Z']>0]['Z']

A    0.833778
C    0.362110
Name: Z, dtype: float64

In [17]:
df[(df['W']>0) & (df['Z']<0)][['W','Z']]

          W         Z
B  0.067727 -1.447222
D  0.026986 -1.162824

#### null, nan

In [18]:
d={'A':[1,2,np.nan],
   'B':[5,np.nan,np.nan],
   'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [19]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### delete nulls in dataframe

In [20]:
df.dropna()

     A    B  C
0  1.0  5.0  1

default drop is axis=0(rows)

In [21]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

drop is axis=1 (columns)

#### groupby

In [22]:
data = {'company' : ['GOO','GOO','FB','FB','TW','TW'],
        'sales' : [200,300,150,450,550,650]}
data

{'company': ['GOO', 'GOO', 'FB', 'FB', 'TW', 'TW'],
 'sales': [200, 300, 150, 450, 550, 650]}

In [23]:
df2 = pd.DataFrame(data)
df2

  company  sales
0     GOO    200
1     GOO    300
2      FB    150
3      FB    450
4      TW    550
5      TW    650

In [24]:
bycomp = df2.groupby('company')
bycomp

In [25]:
bycomp.mean()

         sales
company
FB         300
GOO        250
TW         600

In [26]:
bycomp.sum()

         sales
company
FB         600
GOO        500
TW        1200

In [27]:
bycomp.sum().loc['FB']

sales    600
Name: FB, dtype: int64

In [28]:
df2.groupby('company').max()

         sales
company
FB         450
GOO        300
TW         650

In [29]:
df2.groupby('company').min()

         sales
company
FB         150
GOO        200
TW         550

In [30]:
bycomp.std()

              sales
company
FB       212.132034
GOO       70.710678
TW        70.710678

In [31]:
bycomp.describe()

        sales
        count   mean         std    min    25%    50%    75%    max
company
FB        2.0  300.0  212.132034  150.0  225.0  300.0  375.0  450.0
GOO       2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
TW        2.0  600.0   70.710678  550.0  575.0  600.0  625.0  650.0

#### Concat

In [32]:
df1 = pd.DataFrame({"A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"],
                   "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})
df2 = pd.DataFrame({"A":["A4","A5","A6","A7"],
                   "B":["B4","B5","B6","B7"],
                   "C":["C4","C5","C6","C7"],
                   "D":["D4","D5","D6","D7"]})
df3 = pd.DataFrame({"A":["A8","A9","A10","A11"],
                   "B":["B8","B9","B10","B11"],
                   "C":["C8","C9","C10","C11"],
                   "D":["D8","D9","D10","D11"]})

In [33]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [34]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [35]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [36]:
pd.concat([df1,df2,df3])  # default axis=0 (columns)

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [37]:
pd.concat([df1,df2,df3],axis=1)     # axis=1 (rows)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

#### Merge

In [38]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    "A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"]})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})

In [39]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [40]:
pd.merge(df1,df2, how='inner')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [41]:
pd.merge(df1,df2, how='outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### Difference between merge and concat

Concat : simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
    
    Is a top-level pandas function
    Combines two or more pandas DataFrame vertically or horizontally
    Aligns only on the index when combining horizontally
    Errors when any of the DataFrame contains a duplicate index.
    Defaults to outer join with the option for inner join

Merge  : first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame.
    
    Exists both as a top-level pandas function and a DataFrame method (as of pandas 1.0)
    Combines exactly two DataFrame horizontally
    Aligns the calling DataFrame's column(s) or index with the other DataFrame's column(s) or index
    Handles duplicate values on the joining columns or index by performing a cartesian product
    Defaults to inner join with options for left, outer, and right

#### read files in pandas

In [42]:
df = pd.read_csv('emp12.csv')
df

,1231,Sheethal,9874512510,6/6/1985,Software developer,25000,Hyderbad,7,No
0,1232,Sonu,7458213640,5/5/1995,Software tester,28000,Madhapur,8.0,No
1,1233,Sandeep,9550025123,3/6/1990,Software architect,100000,Gachibowli,7.5,No
2,1234,Manoj,9254762153,1/7/1990,system adminstrator,65000,Hitech city,8.0,No
3,1235,Prasanna,9949171267,6/10/1995,software analyst,15000,Jubliee hills,12.0,Yes
4,1236,Priyanka,7095724262,6/8/1995,tester,20000,Banjara Hills,9.0,No
5,1237,Shravanthi,9584672135,2/9/1995,Cloud analyst,28000,Dilsuknagar,7.0,No
6,1238,Yamini,8657215420,2/6/1995,HR Manager,19000,Dilsuknagar,8.5,No
7,1239,Chaitanya,9125467283,7/4/1994,Architect,25000,Paradise,11.0,Yes
8,1240,Leela Krishna,8542136571,2/3/1994,Software Tester,26000,Secunderabad,12.0,Yes
9,1241,Mahender,9676521477,4/5/1985,Developer,60000,ECIL,7.0,No
10,1242,Yelishetty Shankar,9959243211,4/6/1979,Manager,100000,LBNagar,13.0,Yes
11,1243,Swapna,9949343211,2/7/1982,Associate consultant,23000,LBNagar,8.0,No
12,1244,Nikhil,8019200557,4/8/1994,financial consultant,25000,Tarnaka,8.0,No
13,1245,Sai Kumar,9885662939,4/9/1986,HR Manager,30000,Suchitra,9.0,No

In [43]:
df.to_csv('output',index=False)

In [ ]:
pd.read_html(path)